tap "hashicorp/tap"
brew "cocoapods"
brew "ffmpeg"
brew "gh"
brew "git"
brew "gstreamer"
brew "k9s"
brew "kubernetes-cli"
brew "mas"
brew "minikube"
brew "nvm"
brew "octave"
brew "pyenv"
brew "rustup"
brew "ruby"
brew "wget"
brew "z"
brew "hashicorp/tap/terraform"
cask "affinity"
cask "android-studio"
cask "canva"
cask "claude"
cask "cursor"
cask "discord"
cask "docker"
cask "figma"
cask "firefox"
cask "font-jetbrains-mono-nerd-font"
cask "gcloud-cli"
cask "gemini"
cask "ghostty"
cask "github"
cask "google-chrome"
cask "lm-studio"
cask "moonlight"
cask "notion"
cask "obsidian"
cask "1password"
cask "antigravity"
cask "flutter"
cask "descript"
cask "stats"
cask "tradingview"
cask "tailscale-app"
cask "temurin@17"
cask "zoom"

mas "Xcode", id: 497799835
vscode "akamud.vscode-theme-onedark"
vscode "alexandernanberg.horizon-theme-vscode"
vscode "angular.ng-template"
vscode "azemoh.one-monokai"
vscode "beardedbear.beardedtheme"
vscode "boyswan.glsl-literal"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.path-intellisense"
vscode "clinyong.vscode-css-modules"
vscode "dbaeumer.vscode-eslint"
vscode "delphinbock.grey-rock-theme"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "equinusocio.vsc-community-material-theme"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "firsttris.vscode-jest-runner"
vscode "fivethree.vscode-ionic-snippets"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-pull-request-github"
vscode "hoovercj.vscode-power-mode"
vscode "huytd.nord-light"
vscode "idleberg.hopscotch"
vscode "ionic.ionic"
vscode "johnpapa.vscode-peacock"
vscode "johnpapa.winteriscoming"
vscode "loilo.snazzy-light"
vscode "mariusalchimavicius.json-to-ts"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vsliveshare.vsliveshare"
vscode "nrwl.angular-console"
vscode "peymanslh.blueberry-dark-theme"
vscode "pkief.material-icon-theme"
vscode "psioniq.psi-header"
vscode "redhat.vscode-yaml"
vscode "robbowen.synthwave-vscode"
vscode "slevesque.shader"
vscode "streetsidesoftware.code-spell-checker"
vscode "supermaven.supermaven"
vscode "tinkertrain.theme-panda"
vscode "vunguyentuan.vscode-css-variables"
vscode "wayou.vscode-todo-highlight"
vscode "whizkydee.material-palenight-theme"
npm "@anthropic-ai/claude-code"
npm "chrome-layout-debugger"
npm "corepack"
npm "firebase-tools"
